defmodule ExAwabiTest do
  use ExUnit.Case

  test "tokenize" do
    assert ExAwabi.tokenize("すもももももももものうち") == [
      {"すもも", "名詞,一般,*,*,*,*,すもも,スモモ,スモモ"},
      {"も", "助詞,係助詞,*,*,*,*,も,モ,モ"},
      {"もも", "名詞,一般,*,*,*,*,もも,モモ,モモ"},
      {"も", "助詞,係助詞,*,*,*,*,も,モ,モ"},
      {"もも", "名詞,一般,*,*,*,*,もも,モモ,モモ"},
      {"の", "助詞,連体化,*,*,*,*,の,ノ,ノ"},
      {"うち", "名詞,非自立,副詞可能,*,*,*,うち,ウチ,ウチ"}
    ]
  end

  test "tokenize_n_best" do
    assert ExAwabi.tokenize_n_best("すもももももももものうち", 3) == [
      [
        {"すもも", "名詞,一般,*,*,*,*,すもも,スモモ,スモモ"},
        {"も", "助詞,係助詞,*,*,*,*,も,モ,モ"},
        {"もも", "名詞,一般,*,*,*,*,もも,モモ,モモ"},
        {"も", "助詞,係助詞,*,*,*,*,も,モ,モ"},
        {"もも", "名詞,一般,*,*,*,*,もも,モモ,モモ"},
        {"の", "助詞,連体化,*,*,*,*,の,ノ,ノ"},
        {"うち", "名詞,非自立,副詞可能,*,*,*,うち,ウチ,ウチ"}
      ],
      [
        {"すもも", "名詞,一般,*,*,*,*,すもも,スモモ,スモモ"},
        {"も", "助詞,係助詞,*,*,*,*,も,モ,モ"},
        {"もも", "名詞,一般,*,*,*,*,もも,モモ,モモ"},
        {"もも", "名詞,一般,*,*,*,*,もも,モモ,モモ"},
        {"も", "助詞,係助詞,*,*,*,*,も,モ,モ"},
        {"の", "助詞,連体化,*,*,*,*,の,ノ,ノ"},
        {"うち", "名詞,非自立,副詞可能,*,*,*,うち,ウチ,ウチ"}
      ],
      [
        {"すもも", "名詞,一般,*,*,*,*,すもも,スモモ,スモモ"},
        {"もも", "名詞,一般,*,*,*,*,もも,モモ,モモ"},
        {"も", "助詞,係助詞,*,*,*,*,も,モ,モ"},
        {"もも", "名詞,一般,*,*,*,*,もも,モモ,モモ"},
        {"も", "助詞,係助詞,*,*,*,*,も,モ,モ"},
        {"の", "助詞,連体化,*,*,*,*,の,ノ,ノ"},
        {"うち", "名詞,非自立,副詞可能,*,*,*,うち,ウチ,ウチ"}
      ],
    ]
  end

end
